<a href="https://colab.research.google.com/github/nampy3/n_ml/blob/master/1906ML02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
#reading data from a csv file   from local system
df=pd.read_csv('com.csv')
#reading data from a csv file from url
#df1=pd.read_csv('http://13.234.66.67/summer19/datasets/bank.csv')

In [8]:
#data structure
df.info()
#df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name          6 non-null object
Department    4 non-null object
Manager       4 non-null object
Salary        6 non-null int64
dtypes: int64(1), object(3)
memory usage: 272.0+ bytes

In [10]:
#to print all the dataset directly use variable
df

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [11]:
#top3 rows
df.head(3)

            Name Department     Manager  Salary
0     Robin Hood        NaN         NaN     200
1  Arsene Wenger        Bar  Friar Tuck      50
2     Friar Tuck        Foo  Robin Hood     100

In [13]:
#bottom 2 rows
df.tail(2)

            Name Department      Manager  Salary
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [15]:
#print data of particular column
df['Name']

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [18]:
#for selecting rows and columns
df.iloc[0:,0]

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [19]:
df.iloc[0:,0:2]

            Name Department
0     Robin Hood        NaN
1  Arsene Wenger        Bar
2     Friar Tuck        Foo
3    Little John        Foo
4  Sam Allardyce        NaN
5  Dimi Berbatov        Foo

In [20]:
df

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [22]:
#printing a specific row and column
df.iloc[[0,5],[0,3]]

            Name  Salary
0     Robin Hood     200
5  Dimi Berbatov      50

In [23]:
#salary column
df['Salary']

0    200
1     50
2    100
3    100
4    250
5     50
Name: Salary, dtype: int64

In [25]:
#max salary
df['Salary'].max()

250

In [26]:
#min salary
df['Salary'].min()

50

In [27]:
#mean salary
df['Salary'].mean()

125.0

In [29]:
#sum salary
df['Salary'].sum()

750

In [33]:
#printing values array
x=df.values
x

array([['Robin Hood', nan, nan, 200],
       ['Arsene Wenger', 'Bar', 'Friar Tuck', 50],
       ['Friar Tuck', 'Foo', 'Robin Hood', 100],
       ['Little John', 'Foo', 'Robin Hood', 100],
       ['Sam Allardyce', nan, nan, 250],
       ['Dimi Berbatov', 'Foo', 'Little John', 50]], dtype=object)

In [34]:
#checking type of values
type(x)

numpy.ndarray

In [36]:
#checking type of datasets
type(df)

pandas.core.frame.DataFrame